{"name":"Bluesky Business","tagline":"Bluesky Business reduced late payments by 62.5% in one month with GoCardless","tips":["We helped them reduce debtor days by 50% - within a month","GoCardless helped them reduce late payments by 62.5%","We helped them sign up 70% of customers to pay on time in one month"],"quotes":[{"quote":["Bluesky Business provide professional book-keeping and accounting services. As a growing business, it was important for them to maintain a strong cashflow to finance new hires, and maintain a clear sales ledger and forecast.","“Only 20% of our customers were paying within the required 30 days. We used to spend two full days a month just chasing clients for payment up to three months late,\" says Emma Mills, Director."],"tag":"“We used to spend two full days a month just chasing clients for payment”"},{"quote":["Bluesky needed an assured payment system that integrated with their Sage 50 accounts, and quickly turned to the GoCardless add-on. Now, when each invoice is due, it is automatically collected from client's accounts, and marked as \"paid\" in Sage."],"tag":"“GoCardless gave us the automated Direct Debit solution we needed”"},{"quote":["Within a month of switching to GoCardless, 70% of Bluesky's clients signed up to pay by Direct Debit.","\"Our cashflow and business have been transformed since we started using GoCardless. Within a month our average debtor days had halved and 70% of our customers were paying on time. This means we waste less time chasing payments so we've got the time now to really grow the business\"."],"tag":"“Our cashflow and business have been transformed since we started using GoCardless”"}],"bigquote":{"text":"“Our cashflow and business have been transformed since we started using GoCardless. Within a month our average debtor days had halved and 70% of our customers were paying on time. We're wasting less time chasing payments, and can really focus on growing our business”","img":"/images/testimonials/bluesky__avatar.png","person":"Emma Mills","position":"Bluesky Business"}}
