{"name":"Crowdcube","tagline":"Crowdcube saved admin time and kept the FCA happy by switching to GoCardless","tips":["GoCardless helped save at least 10 hours of admin time every week","GoCardless helped comply with FCA regulations","We helped them grow to 85,000 members"],"quotes":[{"quote":["Crowdcube is the world’s leading investment crowdfunding site. It enables ordinary and professional investors to help entrepreneurs raise the finance they need to grow.","Before switching to GoCardless, investments were made using bank deposits which were held until the relevant pitch had reached its target.","Darren Westlake, CEO explains: “It wasn’t the most efficient way of doing things. Even though we were still quite small we were spending hours every day managing payments: checking our accounts, aligning statements and customers and moving funds to the relevant pitch.”"],"tag":"“We were spending hours every day managing payments”"},{"quote":["Looking for a more scalable solution Darren turned to Direct Debit with GoCardless.","He explains, “We chose GoCardless because it let us set up payments without taking any money until the pitch has reached its target meaning we no longer had to spend hours checking accounts. It was simple to integrate into our systems and really intuitive and easy to use for our entrepreneurs and our customers.”","Crowdcube now ask all customers to use GoCardless and each of their entrepreneurs has their own account so payments can be made directly to them."],"tag":"“GoCardless was simple to integrate into our systems”"},{"quote":["Since joining GoCardless in November 2012, Crowdcube has grown 1000% to 85,000 members but the time they have to spend managing payments has all but disappeared.","“Switching to GoCardless has helped us completely wipe out payments admin which means we now have extra time to work on other projects. What’s more, we never touch client money. Crowdfunding is now a regulated industry so this could’ve been a real issue but with GoCardless we completely bypassed it.”"],"tag":"“Switching to GoCardless has helped us completely wipe out payments admin”"}],"bigquote":{"text":"“Switching to GoCardless has helped us completely wipe out payments admin which means we now have extra time to work on other projects. What’s more, we never touch client money. Crowdfunding is now a regulated industry so this could’ve been a real issue but with GoCardless we completely bypassed it.”","person":"Darren Westlake","position":"Crowdcube"}}
