{"name":"Greater Anglia","tagline":"Greater Anglia saved £21,000 by switching to online Direct Debit with GoCardless","tips":["We helped them save 26 hours of management time a month","We removed the need for paper mandates, saving £300 per month","We helped them avoid a £21,000 upgrade to their server infrastructure"],"quotes":[{"quote":["Greater Anglia, the East Anglia rail franchise, uses Direct Debit to take monthly payments allowing commuters to spread the cost of an annual season ticket.","Before using GoCardless, they managed their Direct Debit in-house for eight years. “Collecting payments was complicated and very manual, and keeping up with Direct Debit scheme rule changes was very time-consuming.” It was also hard for the team to link their legacy Direct Debit management processes with their online offering."],"tag":"“Collecting payments was complicated and very manual”"},{"quote":["Greater Anglia realised they needed an outsourced solution that could adapt to their growing online sales. They quickly identified GoCardless as “by far the best option for online Direct Debit”.","One key advantage was that because of our superior technology, GoCardless was the only provider who could enable Greater Anglia’s customers to set up new season ticket customers entirely online and link this back to their CRM and accounts."],"tag":"“Customers can now set up new season tickets entirely online”"},{"quote":["Switching to GoCardless' online system eliminated the need for paper mandates and statements, saving Greater Anglia £300 every month and reducing management time by 26 hours. Greater Anglia also avoided a costly upgrade to their server infrastructure otherwise needed to comply with the new Direct Debit rules.","Greater Anglia have been delighted with the service since making the switch: “Their system is incredibly simple and their expertise is second to none.\""],"tag":"“Switching to GoCardless has saved us time and money”"}],"bigquote":{"text":"“GoCardless have taken all of the pain out of setting up and managing Direct Debit”","img":"/images/testimonials/greater-anglia__avatar.png","person":"Graham Beton","position":"Greater Anglia Railways"}}
